/* eslint-disable max-len */
import type { TimePeriod } from '../lib/timePeriodContext';

export const PERIODS: TimePeriod[] = [
    {
        events: [
            {
                description:
                    'Sinclair Research выпускает домашний компьютер ZX80',
                year: 1980,
            },
            {
                description: 'Выпуск игровой консоли Atari 5200',
                year: 1982,
            },
            {
                description: 'Выпуск персонального компьютера Commodore 64',
                year: 1983,
            },
            {
                description: 'Apple представляет первый Macintosh',
                year: 1984,
            },
            {
                description: 'Выпуск Nintendo Entertainment System (NES) в США',
                year: 1986,
            },
        ],
        title: 'Технологии',
        id: 1,
    },
    {
        events: [
            {
                description: '"Хищник"/Predator, США (реж. Джон Мактирнан)',
                year: 1987,
            },
            {
                description:
                    '"Кто подставил кролика Роджера"/Who Framed Roger Rabbit, США (реж. Роберт Земекис)',
                year: 1988,
            },
            {
                description:
                    '"Назад в будущее 2"/Back To The Future 2, США (реж. Роберт Земекис)',
                year: 1989,
            },
            {
                description:
                    '"Крепкий орешек 2"/Die Hard 2, США (реж. Ренни Харлин)',
                year: 1990,
            },
            {
                description:
                    '"Семейка Аддамс"/The Addams Family, США (реж. Барри Зонненфельд)',
                year: 1991,
            },
        ],
        title: 'Кино',
        id: 2,
    },
    {
        events: [
            {
                description:
                    'Нобелевская премия по литературе — Дерек Уолкотт, "За блестящий образец карибского эпоса в 64 разделах"',
                year: 1992,
            },
            {
                description: '"Бессоница" — роман Стивена Кинга',
                year: 1994,
            },
            {
                description: 'Нобелевская премия по литературе — Шеймус Хини',
                year: 1995,
            },
            {
                description:
                    '"Гарри Поттер и философский камень" — первая книга серии Дж. К. Роулинг',
                year: 1997,
            },
        ],
        title: 'Литература',
        id: 3,
    },
    {
        events: [
            {
                description:
                    'Премьера балета "Золушка" в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона',
                year: 1999,
            },
            {
                description: 'Возобновлено издание журнала "Театр"',
                year: 2000,
            },
            {
                description:
                    'Премьера трилогии Тома Стоппарда "Берег Утопии", Королевский Национальный театр, Лондон',
                year: 2002,
            },
            {
                description:
                    'Постановка пьесы "Гамлет" в театре "Шекспир и товарищи", США',
                year: 2003,
            },
            {
                description:
                    'Мировая премьера пьесы "Фауст" в рамках международного театрального фестиваля',
                year: 2004,
            },
        ],
        title: 'Театр',
        id: 4,
    },
    {
        events: [
            {
                description:
                    'Баскетбольный клуб ЦСКА стал победителем национального первенства России',
                year: 2006,
            },
            {
                description:
                    'С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры',
                year: 2008,
            },
            {
                description:
                    '13–28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года',
                year: 2010,
            },
            {
                description:
                    '2 августа — начало летних Олимпийских игр в Лондоне',
                year: 2012,
            },
            {
                description: 'XXII зимние Олимпийские игры (Сочи, Россия)',
                year: 2014,
            },
        ],
        title: 'Спорт',
        id: 5,
    },
    {
        events: [
            {
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
                year: 2015,
            },
            {
                description:
                    'Телескоп "Хаббл" обнаружил самую удалённую из известных галактик, получившую обозначение GN-z11',
                year: 2016,
            },
            {
                description:
                    'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
                year: 2017,
            },
            {
                description:
                    'Запуск космического аппарата Solar Probe Plus (позже переименован в Parker Solar Probe), предназначенного для изучения Солнца',
                year: 2018,
            },
            {
                description:
                    'Google объявил о создании 53-кубитного квантового компьютера',
                year: 2019,
            },
            {
                description:
                    'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полёта',
                year: 2020,
            },
            {
                description:
                    'Запуск телескопа James Webb Space Telescope (JWST)',
                year: 2022,
            },
        ],
        title: 'Наука',
        id: 6,
    },
];
